cube = [
    [[32, 34, 37, 33], [33, 38, 35, 40], [30, 31, 33, 36], [34, 35, 39, 36], [28, 26, 29, 30], [30, 31, 34, 36], [29, 30, 34, 32]],
    [[30, 31, 34, 36], [29, 28, 26, 37], [34, 38, 40, 37], [33, 38, 35, 40], [38, 39, 36, 40], [34, 35, 39, 36], [39, 39, 35, 40]],
    [[33, 38, 35, 40], [34, 35, 39, 36], [38, 36, 37, 40], [38, 40, 36, 34], [42, 41, 39, 35], [30, 31, 34, 36], [37, 32, 37, 39]]
]

total_t1 = 0
for row in cube[0]:
    for num in row:
        total_t1 += num
temp_avg_t1 = total_t1 / (len(cube[0]*4))
print(f"อุณหภูมิเฉลี่ยของเมืองที่ 1: {temp_avg_t1:.2f}")

total_t2 = 0
for row in cube[1]:
    for num in row:
        total_t2 += num
temp_avg_t2 = total_t2 / (len(cube[1]*4))
print(f"อุณหภูมิเฉลี่ยของเมืองที่ 2: {temp_avg_t2:.2f}")

total_t3 = 0
for row in cube[2]:
    for num in row:
        total_t3 += num
temp_avg_t3 = total_t3 / (len(cube[2]*4))
print(f"อุณหภูมิเฉลี่ยของเมืองที่ 3: {temp_avg_t3:.2f}")

print("อุณหภูมิสูงที่สุดของเมืองที่ 1 :", cube[0][1][3])
print("อุณหภูมิสูงที่สุดของเมืองที่ 2 :", cube[1][2][2])
print("อุณหภูมิสูงที่สุดของเมืองที่ 3 :", cube[2][4][0])